""" Напишите программу, которая найдёт произведение пар чисел списка.
    Парой считаем первый и последний элемент, второй и предпоследний и т.д.
    Пример:  - [2, 3, 4, 5, 6] => [12, 15, 16]
             - [2, 3, 5, 6] => [12, 15]                                """


def f(x):
    res = []
    for i in range(0, len(x) // 2):
        res.append(x[i] * x[-i - 1])
    if len(x) % 2 != 0:
        res.append(x[len(x) // 2] * x[len(x) // 2])
    return res


lst, lst2, lst3 = [2, 3, 4, 5, 6], [2, 3, 5, 6], [1, 2, 3, 4, 5, 4, 3, 2, 1]

print(f'{lst} => {f(lst)}')
print(f'{lst2} => {f(lst2)}')
print(f'{lst3} => {f(lst3)}')




