""" Напишите программу, которая будет преобразовывать десятичное число в двоичное.
    Пример: - 45 -> 101101
            - 3 -> 11
            - 2 -> 10                                                         """


def f(x):
    lst = []
    while x > 0:
        lst.append(x % 2)
        x //= 2
    return ''.join(map(str, lst[::-1]))


n = [45, 3, 2]

for i in n:
    print(f'{i} -> {f(i)}')




