""" Задайте список из вещественных чисел. Напишите программу,
    которая найдёт разницу между максимальным и минимальным
    значением дробной части элементов.
    Пример: - [1.1, 1.2, 3.1, 5, 10.01] => 0.19           """


def f(x):
    max_ = x[0] % 1
    min_ = x[0] % 1
    for i in x:
        i = i % 1
        if 0 < i <= max_:
            min_ = i
        elif min_ < i > max_:
            max_ = i
    return round(max_ - min_, 3)


lst, lst2 = [1.1, 1.2, 3.1, 5, 10.01], [3, 1.4, 3.6, 5, 6.38]

print(f'{lst} => {f(lst)}')
print(f'{lst2} => {f(lst2)}')




